;Place localized text in this file

[UIScreenListener_Flawless]

; Fallback message in case character specific messages ( for Mox, Elena, or Julian ) are not appropriate at that time in the campaign.
FallbackMessage="Our resistance allies were very impressed with your squad's performance, Commander.  As a reward they have donated $1 $2."

;REWARD VERBIAGE
; The bracketed prefixes indicator which image will display with the message.  Image descriptions as follows:
;
;      [ABANDONED-TANK] - an old abandoned tank
;      [ADVENT-HIDDEN-CACHE] - a soldier finding a hidden cache of loot
;      [ALIEN-JUNK] - a battlefield with lots of alien flotsam
;      [CENTRAL] - Bradford
;      [COLLABORATOR-APT] - an apartment
;      [COUNCIL] - Council 
;      [DEAD-ADVENT] - a dead Advent officer
;	   [ELENA] - Elena
;      [EXALT] - an exalt member
;      [GREMLIN] - an old rusty gremlin
;      [JULIAN-MECH] - one of Julian's mech units
;      [LOST] - a member of the Lost
;      [MOX] - Pratal Mox
;      [RESISTANCE-ALLIES] - several resistance members approaching your ship
;      [RESISTANCE-TRUCK] - an old truck
;      [SECTOIDS] - several sectoids from XCOM 1
;      [SHEN] - young Shen
;      [SURVIVOR] - an old soldier from the original invasion
;      [THIN-MAN] - a thin man
;      [TREASURE-HUNT] - several soldiers searching the area
;      [TYGAN] - Tygan
;      [VAHLEN-LAB] - one of Vahlen's labs
;  
;  Items with no prefix will default to displaying the Holo Globe image.
;

RewardVerbiage[0]="[CENTRAL]Our resistance allies were very impressed with your squad's performance, Commander.  As a reward they have donated $1 $2."
RewardVerbiage[1]="[DEAD-ADVENT]A dead Advent Officer's backpack looked noticeably fuller than most.  A search produced $1 $2."
RewardVerbiage[2]="[ADVENT-HIDDEN-CACHE]On the way back to the evac area, one of your soldiers stumbled across a hidden cache.  Inside you found $1 $2."
RewardVerbiage[3]="[COLLABORATOR-APT]A known Advent collaborator lives in this area.  After breaking down his door and a quick search of his residence, you found $1 $2.  Too bad he wasn't at home..."
RewardVerbiage[4]="[TREASURE-HUNT]The operation went so smoothly, you gave your soldiers extra time for some extra-curricular 'treasure hunting'.  They managed to find $1 $2."
RewardVerbiage[5]="[EXALT]A former Exalt operative stepped from the shadows.  'Bloody bastards double crossed us...  treated us like lab rats.'  he growled.  'Here, take this, you look like you know what you're doing'.  He gave you $1 $2."
RewardVerbiage[6]="[TREASURE-HUNT]A careful search of the bodies on the battlefield produced $1 $2.  A little scrounging never hurt."
RewardVerbiage[7]="[SURVIVOR]A grizzled man approaches slowly after the fight.  'I fought years ago, back during the original invasion. I like what I just saw, so here's something I picked up back in the day.'  He gives you $1 $2. "
RewardVerbiage[8]="[JULIAN-MECH]A rusty mech unit appears on the battlefield.  It plays a recording in Julian's voice. 'Hello, Commander.  I apologize for our first encounter, I didn't mean it. I've reformed, REALLY.  I want to help, just ... please, send one of your new Spark units and FREE me.  Consider this a bri... a gift.'   The unit shuts down and drops its package.  Inside you find $1 $2."
RewardVerbiage[9]="[ALIEN-JUNK]Nearby, you find the remnants of units from the original invasion.  Cyberdisks, Floaters, Drones, and other antiquated junk.  Among the wreckage, you find something useful ... $1 $2."
RewardVerbiage[10]="[COUNCIL]The mysterious, shadowy visage of Council appears on your communicator. 'Your performance on this mission was exemplary, Commander.  As a reward, you will soon receive $1 $2.'"
RewardVerbiage[11]="[RESISTANCE-TRUCK]Nearby, a resistance truck was disabled, due to an earlier attack by Advent. Our soldiers quickly repaired the vehicle.  In appreciation, the driver gave us $1 $2."
RewardVerbiage[12]="[ABANDONED-TANK]You discover an old abandoned army tank, barely held together by rust, probably destroyed by a Sectopod after the first invasion.  Inside, a search reveals $1 $2."
RewardVerbiage[13]="[THIN-MAN]You hear a sibilant whisper from the shadows. A 'thin man' appears, holding its hands up when you move to shoot it.  'They dispose of us.' it hisses.  'No longer need us.  We wish to live.'  It gives you $1 $2, then slides back into the shadows."
RewardVerbiage[14]="[VAHLEN-LAB]In one of the Advent soldier's possession, you discover one of Dr. Vahlen's datapads.  It reveals that one of her research labs is hidden nearby.  Inside, you find the dessicated remains of several test subjects, as well as $1 $2."
RewardVerbiage[15]="[GREMLIN]A beat-up rusty Gremlin appears after the battle and bobs and weaves in front of you.  Following the unit, you discover the body of a resistance specialist, still holding tightly a backpack, in which you find $1 $2.  After you give the soldier a proper burial, the Gremlin lands on the grave and quietly shuts down, its one last duty fulfilled."
RewardVerbiage[16]="[LOST]One of the Lost appears after the battle, clutching a tattered satchel, and your soldiers quickly draw their weapons.  It speaks in guttural English:   'Please ... we didnt want this.  Please ... help us ... we need a cure. We need... '  It suddenly grabs its head and howls in agony.   When it looks up, you can see the remaining humanity slowly fading from its eyes.    A Lost hunting pack howls in the distance and, before you can react, it quickly dashes away, dropping the satchel.  Inside you find a wallet,  family photos, rations, and $1 $2."
RewardVerbiage[17]="[SHEN]Shen approaches you in the ship's hangar after your mission.  'Commander, it sometimes takes us a bit of time to process the junk after clearing one of the ship's rooms... This time I found something interesting!  I hope you can find some use for this.  She hands you $1 $2."
RewardVerbiage[18]="[MOX]Pratal Mox approaches you after the mission and stares at you for a second with his steely alien eyes.  'Commander, I recently went on a solo mission into Advent territory.'  Seeing your expression, he says 'No, it was not sanctioned by Central.  And no, I do NOT need your permission.  I am still Skirmisher.   Regardless, I found something of interest.  Do with it as you will.'   He hands you $1 $2, then strides away.
RewardVerbiage[19]="[ELENA]After the battle, Elena approaches you.  'The Reapers have long memories, and long will we remember the perfect execution of this battle... and of our enemies.   Please accept this as a token of our gratitude.'   She gives you $1 $2.
RewardVerbiage[20]="[SECTOIDS]Almost immediately after you complete the mission, you notice several small figures scurrying away into the shadows, their forms barely illuminated by the pale green glow of their weapons.  'Surely not...' you mutter.   'The old Sectoids vanished years ago.  Remnants from the original invasion?  Or another new enemy race from the Founders?'   Your troops give chase, but soon lose the trail.  In their haste to leave, the enemies dropped a package.  Inside you find $1 $2.
RewardVerbiage[21]="[TYGAN]Tygan quietly approaches you in the corridor of the ship, after your latest mission, and glances around surreptitiously.  'Commander, I know Central will not approve of this request. Let us say it's personal and confidential. Well, as you might already know, I have a certain...affinity for ADVENT burgers. And they are so hard to get, as a fugitive.  The next time you land anywhere near a restaurant, I'm sure they would accept something like this in trade...'  He hands you $1 $2.  'Just one of a few items I 'procured' when I left Advent's service.  Remember, please, not a word of this to Bradford.'"

Title="Bonus Reward"
Error="Error creating specified reward."

TerrorRewardVerbiageM="$1, a member of the resistance group, approaches you.  'I've never seen fighting like that, and I want to be a part of it.'  He joins your forces as a new recruit."
TerrorRewardVerbiageF="After the fight, a resistance member, $1, steps forward.  'I will always be grateful for your rescue. I owe you my life.'  She joins your forces as a new recruit."

AbilityPointVerbiage="<br><br><br>Bonus Ability Points Awarded: $1"